In [1]:
import pandas as pd

import sqlalchemy

In [11]:
engine= sqlalchemy.create_engine("mysql+pymysql://root:sagu@123@localhost:3306/girrafe")

In [12]:
df= pd.read_sql_table("student",engine) #columns=["name","major"])

### HOW TO READ SQL TABLE

In [13]:
df

   student_id    name           major
0           1  Sagnik    Data Science
1           3  Hritik  Social Science
2          12  Sagnik    Data Science
3          13  Nitish        Agronomy

In [25]:
df.columns

Index(['student_id', 'name', 'major'], dtype='object')

In [17]:
a= []
for col in df.columns:
    if col.startswith("nam"):
        
        a.append(col)

In [6]:
d= pd.DataFrame({"student_id":3,"name":"Hritik","major":"Social Science"}, index=[3])

In [8]:
d

   student_id    name           major
3           3  Hritik  Social Science

### adding custom values to the database present in mysql

In [ ]:
d.to_sql(name="student", con=engine, index=False, if_exists="append")

### below we can see that we have successfully added our custom value to the database

In [14]:
df

   student_id    name           major
0           1  Sagnik    Data Science
1           3  Hritik  Social Science
2          12  Sagnik    Data Science
3          13  Nitish        Agronomy

In [14]:
df.columns.values

array(['name', 'major'], dtype=object)

In [19]:
list_of_pop_col= [col for col in df.columns if col.startswith("n")]

In [20]:
list_of_pop_col

['name']

In [21]:
df3= df[list_of_pop_col]

In [22]:
df3

     name
0  Sagnik
1  Sagnik
2  Nitish